903257958/stm32-gd32_bootloader_iap/stm32f103c8_iap_boot/driver/drv_uart.c
#include "drv_uart.h"
#include <errno.h>
#include <stdio.h>
#include <stdarg.h>
#include <string.h>

/* --------------------------------- 硬件抽象层 --------------------------------- */

/* 硬件信息结构体 */
typedef struct {
	uart_periph_t uart_periph;
	iqrn_type_t iqrn;
	dma_channel_t dma_channel;
#if DRV_UART_PLATFORM_STM32F4
	dma_stream_t dma_stream;
	uint32_t dma_tcif_flag;
	uint8_t af;
#endif
	uint8_t idx;
} uart_hw_info_t;

/* 串口硬件信息列表 */
static const uart_hw_info_t uart_hw_info_table[] = {
#if DRV_UART_PLATFORM_STM32F1
	{ USART1, USART1_IRQn, DMA1_Channel5, 0 },
	{ USART2, USART2_IRQn, DMA1_Channel6, 1 },
	{ USART3, USART3_IRQn, DMA1_Channel3, 2 },
#if defined(STM32F10X_HD)
	{ UART4,  UART4_IRQn,  DMA2_Channel3, 3 },
#endif
#endif	/* DRV_UART_PLATFORM_STM32F1 */

#if DRV_UART_PLATFORM_STM32F4
#if defined(STM32F40_41xxx) || defined(STM32F429_439xx)
	{ USART1, USART1_IRQn, DMA_Channel_4, DMA2_Stream5, DMA_FLAG_TCIF5, GPIO_AF_USART1, 0 },
	{ USART2, USART2_IRQn, DMA_Channel_4, DMA1_Stream5, DMA_FLAG_TCIF5, GPIO_AF_USART2, 1 },
	{ USART3, USART3_IRQn, DMA_Channel_4, DMA1_Stream1, DMA_FLAG_TCIF1, GPIO_AF_USART3, 2 },
	{ UART4,  UART4_IRQn,  DMA_Channel_4, DMA1_Stream2, DMA_FLAG_TCIF2, GPIO_AF_UART4,  3 },
	{ UART5,  UART5_IRQn,  DMA_Channel_4, DMA1_Stream0, DMA_FLAG_TCIF0, GPIO_AF_UART5,  4 },
	{ USART6, USART6_IRQn, DMA_Channel_5, DMA2_Stream1, DMA_FLAG_TCIF1, GPIO_AF_USART6, 5 },
#elif defined(STM32F411xE)
	{ USART1, USART1_IRQn, DMA_Channel_4, DMA2_Stream5, DMA_FLAG_TCIF5, GPIO_AF_USART1, 0 },
	{ USART2, USART2_IRQn, DMA_Channel_4, DMA1_Stream5, DMA_FLAG_TCIF5, GPIO_AF_USART2, 1 },
	{ USART6, USART6_IRQn, DMA_Channel_5, DMA2_Stream1, DMA_FLAG_TCIF1, GPIO_AF_USART6, 2 },
#endif
#endif	/* DRV_UART_PLATFORM_STM32F4 */

#if DRV_UART_PLATFORM_GD32F1
	{ USART0, USART0_IRQn, DMA_CH4, 0 },
	{ USART1, USART1_IRQn, DMA_CH5, 1 },
	{ USART2, USART2_IRQn, DMA_CH2, 2 },
#endif	/* DRV_UART_PLATFORM_GD32F1 */
};

#define MAX_UART_NUM	(sizeof(uart_hw_info_table) / sizeof(uart_hw_info_t))

/**
 * @brief	获取串口硬件信息
 * @param[in] uart_periph 串口外设
 * @return	成功返回对应硬件信息指针，失败返回 NULL
 */
static inline const uart_hw_info_t* uart_get_hw_info(uart_periph_t uart_periph)
{
    for (uint8_t i = 0; i < MAX_UART_NUM; i++) {
        if (uart_hw_info_table[i].uart_periph == uart_periph) {
            return &uart_hw_info_table[i];
        }
    }
    return NULL;
}

/**
 * @brief	使能串口外设时钟
 * @param[in] uart_periph 串口外设
 */
static void uart_hw_uart_clock_enable(uart_periph_t uart_periph)
{
#if DRV_UART_PLATFORM_STM32F1
    switch ((uint32_t)uart_periph) {
    case (uint32_t)USART1: RCC_APB2PeriphClockCmd(RCC_APB2Periph_USART1, ENABLE); break;
    case (uint32_t)USART2: RCC_APB1PeriphClockCmd(RCC_APB1Periph_USART2, ENABLE); break;
    case (uint32_t)USART3: RCC_APB1PeriphClockCmd(RCC_APB1Periph_USART3, ENABLE); break;
    case (uint32_t)UART4:  RCC_APB1PeriphClockCmd(RCC_APB1Periph_UART4, ENABLE);  break;
	default: break;
    }
#elif DRV_UART_PLATFORM_STM32F4
    switch ((uint32_t)uart_periph) {
    case (uint32_t)USART1: RCC_APB2PeriphClockCmd(RCC_APB2Periph_USART1, ENABLE); break;
    case (uint32_t)USART2: RCC_APB1PeriphClockCmd(RCC_APB1Periph_USART2, ENABLE); break;
    case (uint32_t)USART3: RCC_APB1PeriphClockCmd(RCC_APB1Periph_USART3, ENABLE); break;
    case (uint32_t)UART4:  RCC_APB1PeriphClockCmd(RCC_APB1Periph_UART4, ENABLE);  break;
    case (uint32_t)UART5:  RCC_APB1PeriphClockCmd(RCC_APB1Periph_UART5, ENABLE);  break;
    case (uint32_t)USART6: RCC_APB2PeriphClockCmd(RCC_APB2Periph_USART6, ENABLE); break;
	default: break;
    }
#elif DRV_UART_PLATFORM_GD32F1
	switch ((uint32_t)uart_periph) {
    case (uint32_t)USART0: rcu_periph_clock_enable(RCU_USART0); break;
    case (uint32_t)USART1: rcu_periph_clock_enable(RCU_USART1); break;
    case (uint32_t)USART2: rcu_periph_clock_enable(RCU_USART2); break;
	default: break;
    }
#endif
}

/**
 * @brief	使能 GPIO 端口时钟
 * @param[in] port GPIO 端口
 */
static void uart_hw_gpio_clock_enable(gpio_port_t port)
{
#if DRV_UART_PLATFORM_STM32F1
    switch ((uint32_t)port) {
    case (uint32_t)GPIOA: RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA, ENABLE); break;
    case (uint32_t)GPIOB: RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB, ENABLE); break;
    case (uint32_t)GPIOC: RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOC, ENABLE); break;
    case (uint32_t)GPIOD: RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOD, ENABLE); break;
    case (uint32_t)GPIOE: RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOE, ENABLE); break;
    case (uint32_t)GPIOF: RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOF, ENABLE); break;
    case (uint32_t)GPIOG: RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOG, ENABLE); break;
	default: break;
    }
#elif DRV_UART_PLATFORM_STM32F4
    switch ((uint32_t)port) {
    case (uint32_t)GPIOA: RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOA, ENABLE); break;
    case (uint32_t)GPIOB: RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOB, ENABLE); break;
    case (uint32_t)GPIOC: RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOC, ENABLE); break;
    case (uint32_t)GPIOD: RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOD, ENABLE); break;
    case (uint32_t)GPIOE: RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOE, ENABLE); break;
    case (uint32_t)GPIOF: RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOF, ENABLE); break;
    case (uint32_t)GPIOG: RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOG, ENABLE); break;
	default: break;
    }
#elif DRV_UART_PLATFORM_GD32F1
	switch ((uint32_t)port) {
    case (uint32_t)GPIOA: rcu_periph_clock_enable(RCU_GPIOA); break;
    case (uint32_t)GPIOB: rcu_periph_clock_enable(RCU_GPIOB); break;
    case (uint32_t)GPIOC: rcu_periph_clock_enable(RCU_GPIOC); break;
    case (uint32_t)GPIOD: rcu_periph_clock_enable(RCU_GPIOD); break;
    case (uint32_t)GPIOE: rcu_periph_clock_enable(RCU_GPIOE); break;
    case (uint32_t)GPIOF: rcu_periph_clock_enable(RCU_GPIOF); break;
    case (uint32_t)GPIOG: rcu_periph_clock_enable(RCU_GPIOG); break;
	default: break;
    }
#endif
}

/**
 * @brief	使能 DMA 时钟
 * @param[in] uart_periph 串口外设
 */
static void uart_hw_dma_clock_enable(uart_periph_t uart_periph)
{
#if DRV_UART_PLATFORM_STM32F1
    if (uart_periph == USART1 || uart_periph == USART2 || uart_periph == USART3)
        RCC_AHBPeriphClockCmd(RCC_AHBPeriph_DMA1, ENABLE);
    else if (uart_periph == UART4)
        RCC_AHBPeriphClockCmd(RCC_AHBPeriph_DMA2, ENABLE);

#elif DRV_UART_PLATFORM_STM32F4
    if (uart_periph == USART1 || uart_periph == USART6)
        RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_DMA2, ENABLE);
    else
        RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_DMA1, ENABLE);

#elif DRV_UART_PLATFORM_GD32F1
	rcu_periph_clock_enable(RCU_DMA0);
#endif
}

#if DRV_UART_PLATFORM_STM32F4
/**
 * @brief	获取 GPIO 引脚源（STM32F4特有）
 * @param[in] pin GPIO 引脚
 * @return	引脚源编号（如9对应PinSource9）
 */
static inline uint8_t uart_hw_get_gpio_pin_source(gpio_pin_t pin)
{
    for (uint8_t i = 0; i < 16; i++)
        if (pin & (1 << i))
			return i;  // GPIO_Pin = 1<<i，对应 PinSource = i
    return 0xFF;
}
#endif	/* DRV_UART_PLATFORM_STM32F4 */

/**
 * @brief	初始化 GPIO 为串口功能
 * @param[in] cfg uart_cfg_t 结构体指针
 */
static void uart_hw_gpio_init(const uart_cfg_t *cfg)
{
#if DRV_UART_PLATFORM_STM32F1
    GPIO_InitTypeDef GPIO_InitStructure;
    GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_AF_PP;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_InitStructure.GPIO_Pin   = cfg->tx_pin;
    GPIO_Init(cfg->tx_port, &GPIO_InitStructure);
	GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_IPU;
    GPIO_InitStructure.GPIO_Pin   = cfg->rx_pin;
    GPIO_Init(cfg->rx_port, &GPIO_InitStructure);

#elif DRV_UART_PLATFORM_STM32F4
	GPIO_InitTypeDef GPIO_InitStructure;
    GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_AF;
    GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
    GPIO_InitStructure.GPIO_PuPd  = GPIO_PuPd_UP;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_InitStructure.GPIO_Pin   = cfg->tx_pin;
    GPIO_Init(cfg->tx_port, &GPIO_InitStructure);
	GPIO_InitStructure.GPIO_Pin   = cfg->rx_pin;
    GPIO_Init(cfg->rx_port, &GPIO_InitStructure);

	const uart_hw_info_t *hw_info = uart_get_hw_info(cfg->uart_periph);
	GPIO_PinAFConfig(cfg->tx_port, uart_hw_get_gpio_pin_source(cfg->tx_pin), hw_info->af);
	GPIO_PinAFConfig(cfg->rx_port, uart_hw_get_gpio_pin_source(cfg->rx_pin), hw_info->af);

#elif DRV_UART_PLATFORM_GD32F1
	gpio_init(cfg->tx_port, GPIO_MODE_AF_PP, GPIO_OSPEED_50MHZ, cfg->tx_pin);
	gpio_init(cfg->rx_port, GPIO_MODE_IPU, GPIO_OSPEED_50MHZ, cfg->rx_pin);
#endif
}

/**
 * @brief	初始化串口外设
 * @param[in] cfg uart_cfg_t 结构体指针
 */
static void uart_hw_uart_init(const uart_cfg_t *cfg)
{
	const uart_hw_info_t *hw_info = uart_get_hw_info(cfg->uart_periph);

