903257958/stm32-gd32_bootloader_iap/stm32f103c8_iap_boot/driver/drv_uart.c
#if DRV_UART_PLATFORM_STM32F1 || DRV_UART_PLATFORM_STM32F4
	/* 配置 USART */
	USART_InitTypeDef USART_InitStructure;
	USART_InitStructure.USART_BaudRate = cfg->baud;
	USART_InitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_None;
	USART_InitStructure.USART_Mode = USART_Mode_Tx | USART_Mode_Rx;
	USART_InitStructure.USART_Parity = USART_Parity_No;
	USART_InitStructure.USART_StopBits = USART_StopBits_1;
	USART_InitStructure.USART_WordLength = USART_WordLength_8b;
	USART_Init(cfg->uart_periph, &USART_InitStructure);

	/* 配置中断 */
	USART_ITConfig(cfg->uart_periph, USART_IT_IDLE, ENABLE);
	NVIC_InitTypeDef NVIC_InitStructure;
	NVIC_InitStructure.NVIC_IRQChannel = hw_info->iqrn;
	NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = cfg->rx_pre_priority;
	NVIC_InitStructure.NVIC_IRQChannelSubPriority = cfg->rx_sub_priority;
	NVIC_Init(&NVIC_InitStructure);

	/* 使能 USART */
	USART_Cmd(cfg->uart_periph, ENABLE);

#elif DRV_UART_PLATFORM_GD32F1
	/* 配置 USART */
	usart_deinit(cfg->uart_periph);
	usart_baudrate_set(cfg->uart_periph, cfg->baud);
	usart_word_length_set(cfg->uart_periph, USART_WL_8BIT);
	usart_parity_config(cfg->uart_periph, USART_PM_NONE);
	usart_stop_bit_set(cfg->uart_periph, USART_STB_1BIT);
	usart_transmit_config(cfg->uart_periph, USART_TRANSMIT_ENABLE);
	usart_receive_config(cfg->uart_periph, USART_RECEIVE_ENABLE);

	/* 配置中断 */
	nvic_irq_enable(hw_info->iqrn, cfg->rx_pre_priority, cfg->rx_sub_priority);
	usart_interrupt_enable(cfg->uart_periph, USART_INT_IDLE);
	
	/* 使能 USART */
	usart_enable(cfg->uart_periph);
#endif
}

/**
 * @brief	初始化 DMA 用于串口接收
 * @param[in] cfg uart_cfg_t 结构体指针
 */
static void uart_hw_dma_init(const uart_cfg_t *cfg)
{
	const uart_hw_info_t *hw_info = uart_get_hw_info(cfg->uart_periph);
	
#if DRV_UART_PLATFORM_STM32F1
	DMA_DeInit(hw_info->dma_channel);
	DMA_InitTypeDef DMA_InitStructure;
	DMA_InitStructure.DMA_PeripheralBaseAddr = (uint32_t)&cfg->uart_periph->DR;	// 外设基地址
	DMA_InitStructure.DMA_PeripheralDataSize = DMA_PeripheralDataSize_Byte;		// 外设数据宽度为8位
	DMA_InitStructure.DMA_PeripheralInc = DMA_PeripheralInc_Disable;			// 外设地址寄存器不变
	DMA_InitStructure.DMA_MemoryBaseAddr = (uint32_t)cfg->rx_buf;				// DMA内存基地址
	DMA_InitStructure.DMA_MemoryDataSize = DMA_MemoryDataSize_Byte;				// 内存数据宽度为8位
	DMA_InitStructure.DMA_MemoryInc = DMA_MemoryInc_Enable;						// 内存地址寄存器递增
	DMA_InitStructure.DMA_BufferSize = RX_SINGLE_MAX + 1;						// 指定DMA缓冲区大小为单次最大接收量加1，只有空闲中断才能判断接收完成
	DMA_InitStructure.DMA_DIR = DMA_DIR_PeripheralSRC;							// 数据传输方向，从外设读取发送到内存
	DMA_InitStructure.DMA_Mode = DMA_Mode_Normal;								// 工作在正常模式，一次传输后自动结束
	DMA_InitStructure.DMA_M2M = DMA_M2M_Disable;								// 没有设置为内存到内存传输
	DMA_InitStructure.DMA_Priority = DMA_Priority_High;							// 高优先级
	DMA_Init(hw_info->dma_channel, &DMA_InitStructure);
	DMA_Cmd(hw_info->dma_channel, ENABLE);
	USART_DMACmd(cfg->uart_periph, USART_DMAReq_Rx, ENABLE);

#elif DRV_UART_PLATFORM_STM32F4
	DMA_DeInit(hw_info->dma_stream);
	DMA_InitTypeDef DMA_InitStructure;
    DMA_InitStructure.DMA_Channel = hw_info->dma_channel;						// DMA通道
    DMA_InitStructure.DMA_PeripheralBaseAddr = (uint32_t)&cfg->uart_periph->DR;	// DMA外设基地址
    DMA_InitStructure.DMA_PeripheralDataSize = DMA_PeripheralDataSize_Byte;		// 外设数据宽度为8位
    DMA_InitStructure.DMA_PeripheralInc = DMA_PeripheralInc_Disable;			// 外设地址寄存器不变
	DMA_InitStructure.DMA_Memory0BaseAddr = (uint32_t)cfg->rx_buf;				// DMA内存基地址
    DMA_InitStructure.DMA_MemoryDataSize = DMA_MemoryDataSize_Byte;				// 内存数据宽度为8位
    DMA_InitStructure.DMA_MemoryInc = DMA_MemoryInc_Enable;						// 内存地址寄存器递增
	DMA_InitStructure.DMA_BufferSize = RX_SINGLE_MAX + 1;						// 指定DMA缓冲区大小为单次最大接收量加1，只有空闲中断才能判断接收完成
    DMA_InitStructure.DMA_DIR = DMA_DIR_PeripheralToMemory;						// 数据传输方向，从外设读取发送到内存
    DMA_InitStructure.DMA_Mode = DMA_Mode_Normal;								// 工作在正常模式，一次传输后自动结束
    DMA_InitStructure.DMA_Priority = DMA_Priority_High;							// 高优先级
    DMA_InitStructure.DMA_FIFOMode = DMA_FIFOMode_Disable;						// 禁用FIFO模式
    DMA_InitStructure.DMA_FIFOThreshold = DMA_FIFOThreshold_Full;				// FIFO阈值为满
    DMA_InitStructure.DMA_PeripheralBurst = DMA_PeripheralBurst_Single;			// 外设突发传输为单次
    DMA_InitStructure.DMA_MemoryBurst = DMA_MemoryBurst_Single;					// 内存突发传输为单次
    DMA_Init(hw_info->dma_stream, &DMA_InitStructure);
    DMA_Cmd(hw_info->dma_stream, ENABLE);
	USART_DMACmd(cfg->uart_periph, USART_DMAReq_Rx, ENABLE);

#elif DRV_UART_PLATFORM_GD32F1
	dma_deinit(DMA0, hw_info->dma_channel);
	dma_parameter_struct dma_init_struct;
	dma_init_struct.periph_addr = cfg->uart_periph + 4;			// 外设基地址，数据寄存器偏移0x04
	dma_init_struct.periph_width = DMA_PERIPHERAL_WIDTH_8BIT;	// 外设数据宽度
	dma_init_struct.memory_addr = (uint32_t)cfg->rx_buf;		// 内存基地址
	dma_init_struct.memory_width = DMA_MEMORY_WIDTH_8BIT;		// 内存数据宽度
	dma_init_struct.number = RX_SINGLE_MAX + 1;					// 只有空闲中断才能判断接收完成，不会产生DMA完成中断
	dma_init_struct.priority = DMA_PRIORITY_HIGH;				// 优先级
	dma_init_struct.periph_inc = DMA_PERIPH_INCREASE_DISABLE;	// 外设不递增
	dma_init_struct.memory_inc = DMA_MEMORY_INCREASE_ENABLE;	// 内存递增
	dma_init_struct.direction = DMA_PERIPHERAL_TO_MEMORY;		// 从外设到内存
	dma_init(DMA0, hw_info->dma_channel, &dma_init_struct);

	dma_circulation_disable(DMA0, hw_info->dma_channel);
	dma_channel_enable(DMA0, hw_info->dma_channel);
	usart_dma_receive_config(cfg->uart_periph, USART_RECEIVE_DMA_ENABLE);
#endif
}

/**
 * @brief	串口格式化打印（硬件层实现）
 * @param[in] hw_info  硬件信息指针
 * @param[in] tx_buf   发送缓冲区
 * @param[in] buf_size 缓冲区大小
 * @param[in] format   格式化字符串
 * @param[in] args     可变参数列表
 */
static void uart_hw_printf(const uart_hw_info_t *hw_info, uint8_t *tx_buf, uint16_t buf_size, 
						   const char *format, va_list args)
{
    vsnprintf((char *)tx_buf, buf_size, format, args);

#if DRV_UART_PLATFORM_STM32F1 || DRV_UART_PLATFORM_STM32F4
    for (uint16_t i = 0; i < strlen((const char *)tx_buf); i++) {
        while (USART_GetFlagStatus(hw_info->uart_periph, USART_FLAG_TXE) == RESET);
        USART_SendData(hw_info->uart_periph, tx_buf[i]);
    }
    while (USART_GetFlagStatus(hw_info->uart_periph, USART_FLAG_TC) == RESET);

#elif DRV_UART_PLATFORM_GD32F1
	for (uint16_t i = 0; i < strlen((const char *)tx_buf); i++) {
		while (usart_flag_get(hw_info->uart_periph, USART_FLAG_TBE) == RESET);
		usart_data_transmit(hw_info->uart_periph, tx_buf[i]);
	}
	while (usart_flag_get(hw_info->uart_periph, USART_FLAG_TC) == RESET);
#endif
}

/**
 * @brief	串口数据发送（硬件层实现）
 * @param[in] hw_info uart_hw_info_t 结构体指针
 * @param[in] data    待发送数据
 * @param[in] len     数据长度（字节）
 */
static void uart_hw_send(const uart_hw_info_t *hw_info, uint8_t *data, uint32_t len)
{
#if DRV_UART_PLATFORM_STM32F1 || DRV_UART_PLATFORM_STM32F4
	for (uint32_t i = 0; i < len; i++) {
		USART_SendData(hw_info->uart_periph, data[i]);		// 将字节数据写入数据寄存器，写入后USART自动生成时序波形
		while (USART_GetFlagStatus(hw_info->uart_periph, USART_FLAG_TXE) == RESET);	// 等待发送完成
	}

#elif DRV_UART_PLATFORM_GD32F1
	for (uint32_t i = 0; i < len; i++) {
		usart_data_transmit(hw_info->uart_periph, data[i]);	// 将字节数据写入数据寄存器，写入后USART自动生成时序波形
		while (usart_flag_get(hw_info->uart_periph, USART_FLAG_TBE) == RESET);	// 等待发送完成
	}
#endif
}

/**
 * @brief	检查串口空闲中断标志
 * @param[in] hw_info uart_hw_info_t 结构体指针
 * @return	true 表示空闲中断触发，false 表示未触发
 */
static inline bool uart_hw_get_it_idle_flag(const uart_hw_info_t *hw_info)
{
#if DRV_UART_PLATFORM_STM32F1 || DRV_UART_PLATFORM_STM32F4
	return (bool)USART_GetITStatus(hw_info->uart_periph, USART_IT_IDLE);

#elif DRV_UART_PLATFORM_GD32F1
	return (bool)usart_interrupt_flag_get(hw_info->uart_periph, USART_INT_FLAG_IDLE);
#endif
}

/**
 * @brief	清除串口空闲中断标志
 * @param[in] hw_info uart_hw_info_t 结构体指针
 */
static inline void uart_hw_clear_it_flag(const uart_hw_info_t *hw_info)
{
#if DRV_UART_PLATFORM_STM32F1 || DRV_UART_PLATFORM_STM32F4
	volatile uint8_t clear;
	clear = hw_info->uart_periph->SR;
	clear = hw_info->uart_periph->DR;

#elif DRV_UART_PLATFORM_GD32F1
	usart_flag_get(hw_info->uart_periph, USART_FLAG_IDLEF);
	usart_data_receive(hw_info->uart_periph);
#endif
}

/**
 * @brief	获取 DMA 当前剩余数据计数
 * @param[in] hw_info uart_hw_info_t 结构体指针
 * @return	DMA 缓冲区剩余未传输的字节数
 */
static inline uint16_t uart_hw_dma_get_curr_data_counter(const uart_hw_info_t *hw_info)
{
#if DRV_UART_PLATFORM_STM32F1
	return DMA_GetCurrDataCounter(hw_info->dma_channel);
#elif DRV_UART_PLATFORM_STM32F4
	return DMA_GetCurrDataCounter(hw_info->dma_stream);
#elif DRV_UART_PLATFORM_GD32F1
	return dma_transfer_number_get(DMA0, hw_info->dma_channel);
#endif
}

/**
 * @brief	重新配置 DMA 接收
 * @param[in] hw_info   uart_hw_info_t 结构体指针
 * @param[in] buf_start 新的接收缓冲区起始地址
 * @param[in] buf_len   新的缓冲区长度
 */
static inline void uart_hw_dma_rx_reconfig(const uart_hw_info_t *hw_info,
                                           uint8_t *buf_start, uint16_t buf_len)
{
#if DRV_UART_PLATFORM_STM32F1
	dma_channel_t channel = hw_info->dma_channel;
	DMA_Cmd(channel, DISABLE);				// 关闭DMA
	while(channel->CCR & DMA_CCR1_EN);		// 等待DMA真正关闭
	channel->CNDTR = buf_len;				// 设置数据长度
	channel->CMAR = (uint32_t)buf_start;	// 设置内存地址
	DMA_Cmd(channel, ENABLE);				// 开启DMA

#elif DRV_UART_PLATFORM_STM32F4
	dma_stream_t stream = hw_info->dma_stream;
	DMA_Cmd(stream, DISABLE);						// 关闭DMA
	while(stream->CR & DMA_SxCR_EN);				// 等待DMA真正关闭
	stream->NDTR = buf_len;							// 设置数据长度
	stream->M0AR = (uint32_t)buf_start;				// 设置内存地址
	DMA_ClearFlag(stream, hw_info->dma_tcif_flag);	// 清除DMA传输完成中断标志位
	DMA_Cmd(stream, ENABLE);						// 开启DMA

#elif DRV_UART_PLATFORM_GD32F1
	dma_channel_t channel = hw_info->dma_channel;
	dma_channel_disable(DMA0, channel);
	dma_transfer_number_config(DMA0, channel, buf_len);
	dma_memory_address_config(DMA0, channel, (uint32_t)buf_start);
	dma_channel_enable(DMA0, channel);
#endif
}

/**
 * @brief   初始化串口硬件
 * @param[in] cfg uart_cfg_t 结构体指针
 */
static void uart_hw_init(const uart_cfg_t *cfg)
{
	uart_hw_gpio_clock_enable(cfg->tx_port);
	uart_hw_gpio_clock_enable(cfg->rx_port);
	uart_hw_uart_clock_enable(cfg->uart_periph);
	uart_hw_dma_clock_enable(cfg->uart_periph);

	uart_hw_gpio_init(cfg);
	uart_hw_uart_init(cfg);
	uart_hw_dma_init(cfg);
}
/* ------------------------------- 硬件抽象层结束 ------------------------------- */

/* --------------------------------- 核心驱动层 --------------------------------- */

#define IDX_BUF_NUM		10

/* 串口接收索引结构体 */
typedef struct {
    uint8_t *start;	// 数据段起始地址
    uint8_t *end;	// 数据段结束地址
} uart_rx_idx_t;

/* 串口接收控制块结构体 */
typedef struct {
    uint16_t 	   data_cnt;				// 已接收数据计数
    uart_rx_idx_t  idx_buf[IDX_BUF_NUM];	// 索引数组，用于管理多段数据
    uart_rx_idx_t *idx_in;					// 写入指针
    uart_rx_idx_t *idx_out;					// 读出指针
    uart_rx_idx_t *idx_end;					// 索引数组结束位置
} uart_rx_cb_t;

/* 私有数据结构体 */
typedef struct {
	uart_rx_cb_t rx_cb;
	uart_dev_t  *dev;
	bool 		 in_use;
} uart_priv_t;

static uart_priv_t g_uart_priv[MAX_UART_NUM];

