903257958/stm32-gd32_bootloader_iap/stm32f103c8_iap_boot/driver/drv_uart.c
static uart_priv_t *uart_priv_alloc(uart_periph_t uart_periph);
static void uart_priv_free(uart_priv_t *priv);
static char *uart_recv_str(uart_dev_t *dev);
static int uart_recv_data(uart_dev_t *dev, uint8_t **data, uint32_t *len);
static int uart_deinit_impl(uart_dev_t *dev);
static void uart_idle_irq_handler(uart_periph_t uart_periph);

/**
 * @brief	定义串口操作函数宏
 * @details 为指定串口生成 printf、send、recv 等操作函数及接口表
 * @param[in] x           串口号（如1、2、3）
 * @param[in] uart_periph 串口外设
 */
#define DEFINE_UART_OPS(x, uart_periph) 							\
static void uart##x##_printf_impl(char *format, ...)				\
{																	\
	const uart_hw_info_t *hw_info = uart_get_hw_info(uart_periph);  \
	uart_dev_t *dev = g_uart_priv[hw_info->idx].dev;				\
	va_list args;													\
	va_start(args, format);											\
	uart_hw_printf(hw_info, dev->cfg.tx_buf, 						\
				   dev->cfg.tx_buf_size, format, args); 			\
	va_end(args);													\
}																	\
static void uart##x##_send_impl(uint8_t *data, uint32_t len)   		\
{															   	    \
	const uart_hw_info_t *hw_info = uart_get_hw_info(uart_periph);  \
	uart_hw_send(hw_info, data, len);								\
}																	\
static char *uart##x##_recv_str_impl(void)							\
{															   	    \
	const uart_hw_info_t *hw_info = uart_get_hw_info(uart_periph);  \
	uart_dev_t *dev = g_uart_priv[hw_info->idx].dev;				\
	return uart_recv_str(dev);								   		\
}																	\
static int uart##x##_recv_data_impl(uint8_t **data, uint32_t *len)	\
{															   	    \
	const uart_hw_info_t *hw_info = uart_get_hw_info(uart_periph);  \
	uart_dev_t *dev = g_uart_priv[hw_info->idx].dev;				\
	return uart_recv_data(dev, data, len);							\
}																	\
static const uart_ops_t uart##x##_ops = { 							\
    .printf = uart##x##_printf_impl, 								\
    .send = uart##x##_send_impl, 									\
    .recv_str = uart##x##_recv_str_impl, 							\
    .recv_data = uart##x##_recv_data_impl, 							\
    .deinit = uart_deinit_impl 										\
}

/* 生成各平台的串口操作函数与接口表 */
#if DRV_UART_PLATFORM_STM32F1
DEFINE_UART_OPS(1, USART1);
DEFINE_UART_OPS(2, USART2);
DEFINE_UART_OPS(3, USART3);
#if defined(STM32F10X_HD)
DEFINE_UART_OPS(4, UART4);
#endif
#endif	/* DRV_UART_PLATFORM_STM32F1 */

#if DRV_UART_PLATFORM_STM32F4
#if defined(STM32F40_41xxx) || defined(STM32F429_439xx)
DEFINE_UART_OPS(1, USART1);
DEFINE_UART_OPS(2, USART2);
DEFINE_UART_OPS(3, USART3);
DEFINE_UART_OPS(4, UART4);
DEFINE_UART_OPS(5, UART5);
DEFINE_UART_OPS(6, USART6);
#elif defined(STM32F411xE)
DEFINE_UART_OPS(1, USART1);
DEFINE_UART_OPS(2, USART2);
DEFINE_UART_OPS(6, USART6);
#endif
#endif	/* DRV_UART_PLATFORM_STM32F4 */

#if DRV_UART_PLATFORM_GD32F1
DEFINE_UART_OPS(0, USART0);
DEFINE_UART_OPS(1, USART1);
DEFINE_UART_OPS(2, USART2);
#endif	/* DRV_UART_PLATFORM_GD32F1 */

/**
 * @brief   初始化串口设备驱动
 * @details 只能配置支持 DMA 的串口，配置为 DMA 接收
 * @param[out] dev uart_dev_t 结构体指针
 * @param[in]  cfg uart_cfg_t 结构体指针
 * @return	0 表示成功，其他值表示失败
 */											
int drv_uart_init(uart_dev_t *dev, const uart_cfg_t *cfg)
{
	if (!dev || !cfg)
        return -EINVAL;

	uart_priv_t *priv = uart_priv_alloc(cfg->uart_periph);
	if (!priv)
		return -ENOMEM;

	/* 初始化接收数据控制块 */
	priv->rx_cb.idx_in = &priv->rx_cb.idx_buf[0];
	priv->rx_cb.idx_out = &priv->rx_cb.idx_buf[0];
	priv->rx_cb.idx_end = &priv->rx_cb.idx_buf[IDX_BUF_NUM - 1];
	priv->rx_cb.idx_in->start = cfg->rx_buf;
	priv->rx_cb.data_cnt = 0;

	priv->dev = dev;
	dev->priv = priv;
    dev->cfg  = *cfg;

	/* 关联操作接口表 */
	const uart_ops_t *uart_ops_table[MAX_UART_NUM] = {
#if defined(STM32F10X_MD)
	&uart1_ops, &uart2_ops, &uart3_ops
#elif defined(STM32F10X_HD)
	&uart1_ops, &uart2_ops, &uart3_ops, &uart4_ops
#elif defined(STM32F40_41xxx) || defined(STM32F429_439xx)
	&uart1_ops, &uart2_ops, &uart3_ops, &uart4_ops, &uart5_ops, &uart6_ops
#elif defined(STM32F411xE)
	&uart1_ops, &uart2_ops, &uart6_ops
#elif DRV_UART_PLATFORM_GD32F1
	&uart0_ops, &uart1_ops, &uart2_ops
#endif
	};
	
	const uart_hw_info_t *hw_info = uart_get_hw_info(cfg->uart_periph);
	dev->ops = uart_ops_table[hw_info->idx];

	/* 初始化硬件 */
	uart_hw_init(cfg);

	return 0;
}

/**
 * @brief   根据索引从私有数据数组中分配一个空闲槽位
 * @param[in] uart_periph 串口外设
 * @return	成功返回槽位指针，失败返回 NULL
 */
static uart_priv_t *uart_priv_alloc(uart_periph_t uart_periph)
{
	const uart_hw_info_t *hw_info = uart_get_hw_info(uart_periph);
    if (!hw_info)
		return NULL;
    
    uint8_t idx = hw_info->idx;
    if (g_uart_priv[idx].in_use)
		return NULL;
    
    g_uart_priv[idx].in_use = true;
    return &g_uart_priv[idx];
}

/**
 * @brief   释放私有数据槽位
 * @param[in,out] priv 待释放的槽位 uart_priv_t 结构体指针
 */
static void uart_priv_free(uart_priv_t *priv)
{
	if (priv)
		priv->in_use = false;
}

/**
 * @brief   串口通用接收函数，内部使用
 * @param[in] dev  uart_priv_t 结构体指针
 * @return	接收到数据字符串的首地址，未接收到数据则为 NULL
 */
static char *uart_recv_str(uart_dev_t *dev)
{
    if (!dev)
        return NULL;
    
    uart_priv_t *priv = (uart_priv_t *)dev->priv;

	/* 缓冲区中有未处理数据 */
    if (priv->rx_cb.idx_in != priv->rx_cb.idx_out) {
        char *start = (char *)priv->rx_cb.idx_out->start;
        uint32_t len = priv->rx_cb.idx_out->end - priv->rx_cb.idx_out->start + 1;

        /* 安全复制出数据（防止越界） */
        static char rx_buf_copy[RX_SINGLE_MAX + 1];
        if (len >= sizeof(rx_buf_copy))
            len = sizeof(rx_buf_copy) - 1;
        memcpy(rx_buf_copy, start, len);
        rx_buf_copy[len] = '\0';

        /* 处理完当前数据段后，移动idx_out指针到下一个位置，准备处理下一段数据 */
        priv->rx_cb.idx_out++;
        if (priv->rx_cb.idx_out == priv->rx_cb.idx_end)
            priv->rx_cb.idx_out = &priv->rx_cb.idx_buf[0];

        return rx_buf_copy;
    }

    return NULL;
}

/**
 * @brief   接收原始二进制数据（不添加 '\0'）
 * @details 该函数不进行 memcpy，也不在数据后追加 '\0'，完全适用于二进制协议（如 Xmodem、IAP、文件传输）
 *          返回的 data 指针指向环形缓冲区的原始内存区域，下一次接收后内容可能会被覆盖。
 * @param[in]  dev  uart_dev_t 结构体指针
 * @param[out] data 返回指向接收数据首地址的指针（指的是 ring buffer 里的原始区域）
 * @param[out] len  返回本次接收到的数据长度
 * @return 0 表示成功接收到数据，其他表示无数据
 */
static int uart_recv_data(uart_dev_t *dev, uint8_t **data, uint32_t *len)
{
    if (!dev || !data || !len)
        return -EINVAL;

    uart_priv_t *priv = (uart_priv_t *)dev->priv;

    /* 无数据 */
    if (priv->rx_cb.idx_in == priv->rx_cb.idx_out) {
        *data = NULL;
        *len = 0;
        return -EAGAIN;
    }

    /* 读取起始地址和长度 */
    uint8_t *start = priv->rx_cb.idx_out->start;
    uint32_t l = priv->rx_cb.idx_out->end - priv->rx_cb.idx_out->start + 1;

    *data = start;
    *len  = l;

    /* 移动 idx_out 到下一段 */
    priv->rx_cb.idx_out++;
    if (priv->rx_cb.idx_out == priv->rx_cb.idx_end)
        priv->rx_cb.idx_out = &priv->rx_cb.idx_buf[0];

