903257958/stm32-gd32_bootloader_iap/stm32f103c8_iap_boot/driver/drv_uart.c
    return 0;
}

/**
 * @brief   去初始化串口
 * @param[in,out] dev uart_dev_t 结构体指针
 * @return	0 表示成功，其他值表示失败
 */	
static int uart_deinit_impl(uart_dev_t *dev)
{
	if (!dev)
		return -EINVAL;

	uart_priv_t *priv = (uart_priv_t *)dev->priv;
	uart_priv_free(priv);
	dev->priv = NULL;
	dev->ops = NULL;
	return 0;
}

/**
 * @brief   串口通用空闲中断函数，内部使用
 * @param[in] uart_periph 串口外设
 */	
static void uart_idle_irq_handler(uart_periph_t uart_periph)
{
	const uart_hw_info_t *hw_info = uart_get_hw_info(uart_periph);
    uart_priv_t *priv = &g_uart_priv[hw_info->idx];
	uart_dev_t *dev = priv->dev;

    if (uart_hw_get_it_idle_flag(hw_info)) {	// 检查空闲中断标志
		uart_hw_clear_it_flag(hw_info);			// 清除空闲中断标志

		/* 计算已接收数据量 */
		priv->rx_cb.data_cnt += (RX_SINGLE_MAX + 1) -
			uart_hw_dma_get_curr_data_counter(hw_info);

		/* 标记这一段数据的结尾 */
		priv->rx_cb.idx_in->end = &dev->cfg.rx_buf[priv->rx_cb.data_cnt - 1];

		/* 接收数据后in指针向后移动一位 */
		priv->rx_cb.idx_in++;
		if (priv->rx_cb.idx_in == priv->rx_cb.idx_end)
			priv->rx_cb.idx_in = &priv->rx_cb.idx_buf[0];

		/* 判断数据缓冲区剩余大小 */
		if (dev->cfg.rx_buf_size - priv->rx_cb.data_cnt >= RX_SINGLE_MAX) {
			/* 剩余大小足够再接收一次数据，标记下一段数据的start */
			priv->rx_cb.idx_in->start = &dev->cfg.rx_buf[priv->rx_cb.data_cnt];
		} else {
			/* 剩余大小不够再接收一次数据，回卷 */
			priv->rx_cb.idx_in->start = &dev->cfg.rx_buf[0];
			priv->rx_cb.data_cnt = 0;
		}

		/* 重新配置 DMA ，准备下一次接收 */
		uart_hw_dma_rx_reconfig(hw_info, priv->rx_cb.idx_in->start, RX_SINGLE_MAX + 1);
	}
}

/* 各串口中断服务函数 */
#if defined(USART0)
void USART0_IRQHandler(void) { uart_idle_irq_handler(USART0); }
#endif

#if defined(USART1)
void USART1_IRQHandler(void) { uart_idle_irq_handler(USART1); }
#endif

#if defined(USART2)
void USART2_IRQHandler(void) { uart_idle_irq_handler(USART2); }
#endif

#if defined(USART3)
void USART3_IRQHandler(void) { uart_idle_irq_handler(USART3); }
#endif

#if defined(UART4)
void UART4_IRQHandler(void)  { uart_idle_irq_handler(UART4);  }
#endif

#if defined(UART5)
void UART5_IRQHandler(void)  { uart_idle_irq_handler(UART5);  }
#endif

#if defined(USART6)
void USART6_IRQHandler(void) { uart_idle_irq_handler(USART6); }
#endif

/* ------------------------------- 核心驱动层结束 ------------------------------- */
